common/models/Admin.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `admin` WHERE (`username`='guitta.ortet') AND (`status`=10)