backend/models/Marca.php

SELECT * FROM `marca` WHERE `estado`=1
---
    public function getMarcas() {
        $models = ArrayHelper::map(Marca::find()->where(['estado' => 1])->all(),'idmarca','nome');