backend/models/Produtor.php

    public function getUsersProdutors($id) {
        $model = Produtor::find()->where(['estado' => 1])->all();
---
SELECT * FROM `produtor` WHERE `estado`=1